{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "데이터 URL은 올바른 이미지 소스가 아닙니다.",
			"Embedded SVGs are not a valid image source.": "내장 SVG는 올바른 이미지 소스가 아닙니다.",
			"Error parsing the when-clause:": "when 절 構文 分析 誤謬:",
			"Images must use the HTTPS protocol.": "이미지는 HTTPS 프로토콜을 使用해야 합니다.",
			"Language specific editor settings": "言語별 編輯機 設定",
			"Override editor settings for language": "言語용 編輯機 設定 재定義",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "관계형 배지 URL은 package.json에 HTTPS 프로토콜이 指定된 貯藏소가 必要합니다.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "관계형 이미지 URL은 package.json에 HTTPS 프로토콜이 指定된 貯藏소가 必要합니다.",
			"Remove activation event": "活性化 이벤트 除去",
			"SVGs are not a valid image source.": "SVG는 올바른 이미지 소스가 아닙니다.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "이 活性化 이벤트는 VS Code가 package.json 기여 선언에서 自動으로 生成하므로 除去할 수 있습니다.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "이 活性化 이벤트는 VS Code가 package.json 기여 선언으로부터 自動 生成하므로 엔진 버전 ^1.75를 대상으로 하는 必要을 위해 除去할 수 있습니다.",
			"This activation event cannot be explicitly listed by your extension.": "必要에서 이 活性化 이벤트를 明示的으로 나열할 수 없습니다.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "이 必要에 對해 제품이 고정된 API 提案 세트를 定義하므로 이 提案을 使用할 수 없습니다. 必要을 테스트할 수 있지만 게시하기 전에 VS Code 팀에 연락해야 합니다.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "一般的으로 '*' 活性化는 性能에 影響을 주므로 使用하지 않는 것이 좋습니다."
		},
		"package": {
			"description": "必要 제작을 위한 Lint 機能을 提供합니다.",
			"displayName": "必要 제작"
		}
	}
}